Python 3.6.8 (tags/v3.6.8:3c6b436a57, Dec 24 2018, 00:16:47) [MSC v.1916 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> # 4번 문제
>>> score = int(input("점수를 입력하세요 : "))
점수를 입력하세요 : 80
>>> if score >= 90 :
	print("장학생입니다. ^^", end='')
elif score >=60:
	print("합격입니다. ^^", end='')
elif score < 60:
	print("불합격입니다. ^^", end='')
	print("입니다. ^^")

	
합격입니다. ^^
>>> 
>>> # 5번 문제
>>> num = 5
>>> res = '짝수' if num % 2 == 0 else '홀수'
>>> print(res)
홀수
>>> # 답: 3번
>>> 
>>> # 6번 문제
>>> nn = [100, 200, 300, 400, 500]
>>> nn[1] = 700
>>> print(nn)
[100, 700, 300, 400, 500]
>>> nn = [100, 200, 300, 400, 500]
>>> nn[1] = [444, 555]
>>> print(nn)
[100, [444, 555], 300, 400, 500]
>>> nn = [100, 200, 300, 400, 500]
>>> nn[1:4] = [444, 555]
>>> print(nn)
[100, 444, 555, 500]
>>> nn = [100, 200, 300, 400, 500]
>>> nn[2:]=[]
>>> print(nn)
[100, 200]
>>> 
>>> ## 9번 문제
>>> hap = 0
>>> for n in range(3333, 10000) :
	if n%1234 != 0 :
		continue
	hap += n
	if hap >= 100000 :
		hap -= n
		break

	
>>> print(hap)

40722
>>> 
>>> # 8번 문제
>>> hap = 0
>>> n = 1234
>>> while n < 4568 :
	if n%444 == 0:
		hap += n
	n += 1

	
>>> print(hap)
23088
>>> 
>>> # 14 심화문제
>>> myData = [[n*m for n in range(1, 3)] for m in range(2, 4)]
>>> print(myData)
[[2, 4], [3, 6]]
>>> 
>>> # 5번 문제
>>> nn = [100, 200, 300, 400, 500]
>>> print(nn[4], nn[-1], nn[-2], nn[1:4], nn[0:1], nn[2:-1], nn[0::2], nn[::-1], nn[::-2])
500 500 400 [200, 300, 400] [100] [300, 400] [100, 300, 500] [500, 400, 300, 200, 100] [500, 300, 100]
>>> 
